using UnityEngine;

public class Monster2 : MonoBehaviour
{
    // 원거리 몬스터 투사체 프리팹이랑 데미지 구현
    // 이렇게 짜서 저 던져주면 제가 알아서 병합 하면 된다. 
    // 프로그래머는 2~3명 /UI+맵 한명
    // 보상 해드림 (계약서 작성)
    // 전 완전 진심 입니다.
    // 외주 컨텍/그래픽 결과물들 적용/
    // 제가 찾는 사람은 잘하는 사람이 아님<- 잘하는데 고집 센 사람 자신의 스타일 확고
    // 대화가 잘통하고 인성이 좋은사람 기본기가 갖춰진 사람(AI 써도 상관없음)
    // 차기 회사 차렸을때 기획자도 찜 해논 상태
    // 일러스트레이터 있고/외주자들 섭외된 상태
    // 자본 과 프로그래머 
    // 자기 게임 만들고 싶다.<- 나중에 금액적으로 지원 해줄겁니다.(스타트업 혜택)
    // 자본 생기면 회사 바로 설립 할겁니다.
    // 한국 배경이 게임의 목마른 상태임 <- 이 틈새 시장 공략 
    // +케데헌 노젖기 <- 여파는 있다.
    // 스토리 구상 끝 세계관 끝 캐릭터들간 서사도 다 있음 자본 + 그래픽 작업은 지가 알아서 한대 
    // 몸만 오면 GO -> 같이 안할 이유가 있나?
    // + 같이 하면 재밌을거 같아요
    // 서로 상의하고 아이디어 공유하고 병합 했는데 버그 나고
    // 투자 하신다고 생각 해달라 추후에 무조건 보상 하겠다.
    // 채용해서 월급 두둑히 줄거고
    // 일러스트레이터 레이어 세분화 ->LIVE2D 2주씩 -> LIVE2D?? -> 도트로 인게임 캐릭터화
    // 스토리모드(제가 개발)랑 일반모드(지원)
    // 출시를 해요 인지도를 쌓고 
    // 차기작을 출시 하거나 업데이트
    // 업데이트 -> 회사를 설립 -> 진정한 한국 배경 서브컬쳐 <- 장르는 미정(그 시대에 유행이 달라서)
    // 스파인 <- 일러스트를 레이어 세분화 스파인 작업자 던져주면 3D 애니메이션 풍 캐릭터 변화 
    // 다 계획적으로 구상함
    // 지금 당장 안하셔도 된다.
    // 미리 해놓으면 좋다. -> 눈에 안보여서 재미없다.
    // 이상현님(몬스터10종/보스3종)/허범님(유물(8개/패시브8개)
    
}
